module.exports.config = {
  name: "bot",
  version: "1.0.0",
  hasPermission: 0,
  credits: "𝐒𝐡𝐚𝐡𝐚𝐝𝐚𝐭 𝐈𝐬𝐥𝐚𝐦",
  description: "Random fun reply when someone says Bot",
  commandCategory: "Fun",
  usages: "[Bot]",
  cooldowns: 2,
};

const botReplies = [
  "বেশি bot Bot করলে leave নিবো কিন্তু😒😒",
 "শুনবো না😼 তুমি আমার বস ঋদু কে প্রেম করাই দাও নাই🥺পচা তুমি🥺",
 "আমি আবাল দের সাথে কথা বলি না,ok😒",
 "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈",
 "Bolo Babu, তুমি কি আমার বস ঋদু কে ভালোবাসো? 🙈💋",
 "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑",
 "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?",
 "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬"
];

module.exports.run = async function ({ api, event }) {
  const reply = botReplies[Math.floor(Math.random() * botReplies.length)];
  api.sendMessage(reply, event.threadID, event.messageID);
};
