module.exports.config = {
    name: "emoji_ripley",
    version: "10.1",
    hasPermssion: 0,
    credits: "𝗦𝗵𝗮𝗵𝗮𝗱𝗮𝘁 𝗦𝗔𝗛𝗨",
    description: "Emoji দিলে টেক্সট পাঠাবে 😍",
    commandCategory: "noprefix",
    usages: "😘🥰😍",
    cooldowns: 5
};

const emojiTextMap = {
    "🙂": "সেন্টি খাচ্ছো কেন বাবু🙂",
    "😘": "চুম্মা চাটি ইনবক্সে করো🙄",
    "😗": "চুম্মা চাটি ইনবক্সে করো🙄",
    "😙": "চুম্মা চাটি ইনবক্সে করো🙄",
    "😽": "চুম্মা চাটি ইনবক্সে করো🙄",
    "🥶": "ঠান্ডা লাগছে নাকি বাবু আসো কাছে আসো গরম করে দেই।🥵",
    "🤡": "একদম তোমার সাথে মানায় 😂",
    "💋": "তোমার দুই ঠোঁট যেনো রসালো মিষ্টি দেখলেই চুষতে মন চায়😍",
    "😏": "মুখ ভেঙ্গাও কেন🙄",
    "💔": "আহারে বাবুটার মন ভেঙে গেলো😅",
    "🐸": "তোমার ফেভারিট খাবার নাকি?",
    "💴": "ওহ! টাকা পাঠাচ্ছো নাকি আমাকে? 💴😌",
    "☕": "চলো এক কাপ চা খাই, মনটা হালকা হবে ☕😊",
    "🙄": "উপরে কি দেখো?🙄",
    "🥀": "লজ্জাশরম নাই নাকি ফুল দেও বফ থাকার সত্বেও🙄",
    "🤤": "লুইচ্চা বেডি লোল পরে কেন?🌚",
    "😒": "এইভাবে মুখ বানাইও না, মনটা খারাপ হয়ে যায় 😒🙄",
    "💩": "গু দিলি কেন তুই খা এখন।",
    "😠": "বাবু রাগ করো না প্লিজ।🥺",
    "👋": "জোরে দেও থাপ্পড়।",
    "👊": "আমায় গুষি দিবি এত সাহস তর।😠",
    "🫦": "এই ঠোঁটটা অনেক বেশি আকর্ষণীয় 🫦😉",
    "🤦‍♂️": "আহ! কি ভুল করলাম আবার 🤦‍♂️",
    "👩‍❤️‍💋‍👨": "তুমি আর আমি😘💞",
    "🌚": "কিরে কাল্লু 🌚👀",
    "🍆": "বেগুন তর পুটকিতে দে।🍆🙈",
    "🍌": "কলা খাবে নাকি বাবু?🍌😂",
    "🐱": "কিউট বাচ্চা বিড়ালের মতো লাগছ 🐱✨",
    "🐼": "পান্ডা মতো মিষ্টি আর লাজুক 🐼💕",
    "🌸": "ফুলের মতো নরম আর সুন্দর 🌸💗",
    "😉": "চোখ মারো কেন শরম নাই বেয়াদব।🤦‍♂️"
};

module.exports.handleEvent = async ({ api, event }) => {
    const { threadID, messageID, body } = event;
    if (!body || body.length > 2) return;

    const emoji = body.trim();
    const text = emojiTextMap[emoji];
    if (!text) return;

    api.sendMessage(text, threadID, messageID);
};

module.exports.run = () => {};
